app/controllers/api/playlists_controller.rb

    def create
        @playlist = Playlist.new(playlist_params)
        @playlist.creator_id = current_user.id
        if @playlist.save
---
INSERT INTO "playlists" ("title", "genre", "created_at", "updated_at", "description", "artwork", "creator_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test"], ["genre", "test"], ["created_at", "2021-11-08 11:10:10.904092"], ["updated_at", "2021-11-08 11:10:10.904092"], ["description", "testing"], ["artwork", ""], ["creator_id", 1]]