app/controllers/api/songs_controller.rb

    def index
        @songs = Song.all
---
SELECT  "songs".* FROM "songs" WHERE (1) LIMIT $1  [["LIMIT", 1]]