app/views/api/songs/index.json.jbuilder

SELECT "songs".* FROM "songs"
---
json.songs do
    @users.songs.each do |song|