app/models/user.rb

    def reset_session_token!
        self.update!(session_token: SecureRandom.urlsafe_base64) && self.session_token
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "B0vIr8UCDvb_LpddPkFB4w"], ["updated_at", "2021-10-19 21:33:18.113846"], ["id", 1]]